Repository: giellalt/corpus-fin
Catalog: tmx/sme/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=482_lang=finnish.html.tmx
Source language: fin
Languages: sme

source: Olen 18-vuotias poika Sodankylästä.
sme: Mun lean 18 jahkásaš gánda Soađegilis.

source: Olen aina asunut täällä kuten vanhempanikin, mutta sukuni on kotoisin Sompion alueelta, mikä on lähellä Vuotson kylää.
sme: Lean álot orron dáppe ja nu mu vánhematge, muhto mu sohka lea eret Soabbada guovllus, mii lea Vuohču gili lahkosis.

source: Sukuni maat ovat jääneet tekojärven alle.
sme: Mu soga eatnamat leat dál báhcán dahkujávrri vuollái.

source: Äidinkieleni on suomen kieli ja olen alkanut lukea saamea ala-asteella.
sme: Mu eatnigiella lea suomagiella ja lean lohkagoahtán sámegiela vuolledásis.

source: Saamen kieli on kadonnut suvustani jo kokonaan ja saamelaisuus on ollut suuri häpeä.
sme: Mu sogas sámegiella lei jo ollásit jávkan ja sámevuohta lea leamaš stuorra heahpat.

source: Sain lapsena sellaisen kuvan, että saamen kieli ja saamelainen kulttuuri ovat kuolleet ja niistä voi vain lukea kirjoista.
sme: Mánnán mun ožžon gova, ahte sámegiella ja sámekultuvrra leat jápmán ja daid birra sáhttá lohkat dušše girjjiin.

source: Mutta nyt minun sukupolveni on kiinnostunut juuristaan ja saamen kielikin on palaamassa sukuumme.
sme: Muhto dál mu sohkabuolva lea beroštuvvan iežas ruohttasiin ja sámegiella lea fas máhccame min sohkii.

source: Saamen kieli on minulle tärkeä asia ja yritän käyttää sitä aina kuin siihen on mahdollisuus.
sme: Sámegiella lea munnje dehálaš ja geahččalan geavahit dan álot go lea vejolašvuohta.

source: Olen myös ajatellut siirtää sen omille lapsilleni.
sme: Lean maiddai jurddašan sirdit dan iežan mánáide.

source: Olen tämän kevään (2011) abiturientti ja aion jatkaa yliopistoon.
sme: Lean dán giđa (2011) abiturientta ja áiggun joatkit universitehtii.

source: Olen hakenut sekä Rovaniemelle lakia lukemaan että Ouluun saamen kieltä lukemaan.
sme: Lean dál ohcan sihke Roavenjárgii studeret lága ja Oului studeret sámegiela.

source: Työn ja opintojen takia minulle ei jää kovin paljoa vapaa-aikaa.
sme: Bargguid ja studerema dihte munnje ii báze nu ollu friddjaáigi.

source: Mutta kun sitä jää, tykkään urheilla ja viettää aikaa kavereiden kanssa.
sme: Muhto dalle go báhcá, liikon valáštallat ja leat lagašolbmuiguin.

source: Mitä sitten ” aikuisena " teenkin, tärkeintä on, että saan tehdä töitä myös saamen kielellä ja saamelaisasioissa.
sme: Maid de " rávesolmmožin " barggažan, deahaleamos lea ahte oaččun bargat maiddái sámegillii ja sámeáššiiguin.
